"""3. Пользователь вводит месяц в виде целого числа от 1 до 12.
 Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
  Напишите решения через list и через dict."""

month = input('Введите целое чсло от 1 до 12: ')

while int(month) < 1 or int(month) > 12:
    print('Ошибка ввода!')
    month = input('Введите целое чсло от 1 до 12: ')
month = int(month)

# Решение через list

season_list = ['зима', 'весна', 'лето', 'осень']

if month == 12:
    season = season_list[0]
else:
    season = season_list[month // 3]

print(f'Ваш сезон - {season}')

# Решение через dict

month_dict = {
    1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень",
    10: "осень", 11: "осень", 12: "зима"
}
print(f'Ваш месяц - {month_dict[month]}')
